---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils
source: html/64276e6a-ff06-ed29-f8cc-b804b644951a.htm
---
# IFCExtrusionCalculatorUtils Methods

Calculates the extrusion data from a Revit geometry object.